content/posts/20250105_orgmode-lesson-notes/index.md
+++
title = "Using Org Mode / LaTeX for Lesson Notes"
featuredImage = "20250105_orgmode-banner.webp"
date = 2025-01-06
lastmod = 2025-01-23T14:43:46+11:00
tags = ["Emacs", "OrgMode", "LaTeX", "Teaching"]
categories = ["Blog"]
draft = false
weight = 3001
author = "Matt Maguire"
+++

Over the past year, I have been using \\(\LaTeX\\) together with Emacs to produce lesson notes for some of my classes. One reason I went with Emacs instead of TeX Studio and the like was that Emacs provided a lot of shortcuts and completion features. I was finding though that \\(\LaTeX\\) documents can sometimes become a bit verbose, which made me wonder about ways to make it easier to navigate the documents.

The other thing I was experimenting with last year was Emacs' Org Mode. This is a text "markdown" language that lets you structure your documents with headings that can be expanded and collapsed, so that you can quickly navigate documents, hide unneeded detail and focus on what's important in the here-and-now. The articles in this blog website are all written in Org Mode, and are then exported and pushed to the web. I was wondering whether Org Mode might allow me to more easily navigate the \\(\LaTeX\\) lesson notes that I have been producing and generate PDF documents for printing.


## The Case for Org Mode {#the-case-for-org-mode}

A bit of research revealed that Org Mode text files can indeed be exported to \\(\LaTeX\\) that can then be used to generate nice PDF documents. Org Mode is $\LaTeX$-aware, so that if you need to fall back on \\(\LaTeX\\) features that go beyond what the simple Org Mode document format can handle, you can easily include necessary snippets of \\(\LaTeX\\) code. The Babel feature of Org Mode also allows you to embed code and content produced by other programming languages such as Gnuplot, Python and Lisp. The simplicity of Org Mode's markdown language, its ability to manage complexity through its outlining mode and the flexibility in integrating other programming languages makes for a compelling case in producing maths-based content.

Another option I looked at was [Typst](https://typst.app/), a newer markdown-based solution for writing technical documnents. The basic markdown compiler is open-source and can be installed for free on your computer, but the full web-based service is a commercial offering. While the markdown language looks nice, the tool is not as mature as $\LaTeX$/TiKZ, and there would be something of a learning curve to get across [CetZ](https://github.com/johannes-wolf/cetz), which is Typst's answer to \\(\LaTeX\\)'s [TiKZ](https://tikz.net/) graphics package. Given that I am already using \\(\LaTeX\\) and Org Mode in spearate spheres of my work, I decided that it makes sense to combine these two tools.


## Setting Up Org Mode to Use \\(\LaTeX\\)'s _exesheet_ class {#setting-up-org-mode-to-use-latex-s-exesheet-class}

The \\(\LaTeX\\) documents I have been using are based on the \\(\LaTeX\\) [exesheet](https://ctan.org/pkg/exesheet) package. This allows me to easily typeset groups of problems either in single or multi-column mode. By default Org Mode uses the \\(\LaTeX\\) _article_ document class, so the first step was to see if I could get Org Mode to use the _exesheet_ class and its associated features. The approach I used is described in the following useful video:

{{< youtube 0qHloGTT8XE >}}

The creator of that video posted the the associated resources [here](https://jakebox.github.io/youtube/org_latex_video.html).

According to that video, the first step was to set up a custom class so Org Mode could recognise the _exesheet_ package. I therefore added the following code to my Doom Emacs _config.el_ file:

```elisp
(after! ox-latex
(add-to-list 'org-latex-classes
             '("org-exesheet"
               "\\documentclass{exesheet}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(after! ox
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines)))
```

The `after!` macros make sure that Doom emacs runs the configuration code at the appropriate time during start-up. The first one defines the custom document class that refers to the \\(\LaTeX\\) exesheet package. The second one enables an extended feature that allows me use an Org Mode heading purely to structure my document and hide detail without creating a corresponding section heading in the final document.

The next step was to create a set-up file that includes a common set of preamble to declare packages and define macros that should be available to all my lesson note documents. I created a file called `lesson-preamble.org`. Some highlights from that file:

```nil
#+LATEX_CLASS: org-exesheet
#+LATEX_CLASS_OPTIONS: [12pt,a4paper,marginwidth=unset]
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage{amssymb} % Access to extra math symbols
#+LATEX_HEADER: \usepackage{amsmath} % Access to extra math symbols
#+LATEX_HEADER: \usepackage{diffcoeff}
...
```

The first line refers to the custom class I defined in my `config.el` Emacs configuration, and the second line sets up the page settings (eg. In Australia we normally use A4 size paper). The third line disables the generation of a table of contents, and then I list out the \\(\LaTeX\\) packages that my lesson notes typically rely on.

After the packages, I then have some macro definitions:

```nil
#+LATEX_HEADER: \geometry{margin=1.5cm}
#+LATEX_HEADER: \newcommand{\cloze}[1]{\underline{\hspace*{#1}}}
#+LATEX_HEADER: \newcommand{\notes}[3][\empty]{%
#+LATEX_HEADER:     \noindent\ifthenelse{\equal{#1}{\empty}}
#+LATEX_HEADER:             {\\}
#+LATEX_HEADER:             {\vspace{#1}\\}
#+LATEX_HEADER:     \foreach \n in {1,...,#2}{%
#+LATEX_HEADER:         \ifthenelse{\equal{#1}{\empty}}
#+LATEX_HEADER:             {\rule{#3}{0.5pt}\\}
#+LATEX_HEADER:             {\rule{#3}{0.5pt}\vspace{#1}\\}
#+LATEX_HEADER:         }
#+LATEX_HEADER: }
```

-   I set the margins to make better use of the available space on the worksheet (line 1).
-   The `cloze` macro (line 3) lets me easily create an underlined blank space for students to fill in during the lesson.
-   The `notes` macro (lines 5-14) allows me to create a set of lines for students to write their working out. I tend not to use this much, preferring to just leave some blank space for students to draw and write in as they wish.


## Let's Make a Lesson! {#let-s-make-a-lesson}

Now that we've done the set-up, let's put together some lesson notes. The first thing is to create a file ending in `.org` and refer to the setup file we just made:

```nil
#+SETUPFILE: lesson-preamble.org
```
