content/posts/20250105_orgmode-lesson-notes/index.md


### Title and Lesson Intentions {#title-and-lesson-intentions}

We will now create a Org section to display the lesson title and learning intentions:

```org
* Header :ignore:
#+latex: \begin{center}\textsc{
  Y12 Advanced Topic 1: Differential Calculus \\
  Lesson 1: Introduction to Differentiation
#+latex: }\end{center}\begin{small}\begin{singlespacing}\begin{tcolorbox}[fonttitle=\bfseries,title=\textbf{Learning intentions:}]

Students will:
#+attr_latex: :options [itemsep=0pt]
- Revise the foundations of Indices, including index laws involving negative indices
- Revise fractional indices.

/Textbook Reference: Y11 Canbridge Advanced Ex. 7A, 7B/
#+latex: \end{tcolorbox}\end{singlespacing}\end{small}
```

-   In line 1, I use the tag `:ignore:` to supress the creation of a \\(\LaTeX\\) `\section` header. While Org Mode headings will normally create sections and subsections in your document, this particular Org Mode heading is just there for organisational purposes, so that I can fold up and hide away this beginning part of the document and make it easier to navigate straight to the section(s) that I am currently working on.

-   lines 2 and 5 output some \\(\LaTeX\\) code to make the heading in lines 3 and 4 be printed in small caps and nicely centered. It also sets up a nice \\(\LaTeX\\) `tcolorbox` to highlight the lesson intentions. The `#+latex:` lets you insert arbitrary lines of \\(\LaTeX\\) code into the final document if you want to achieve effects not easily realised through the standard Org Mode structures.

    Technically, the `tex and latex output logo math modetex and latex output logo math mode#+latex:` is not required, because if Org Mode detects any \\(\LaTeX\\) code in your document, it should automatically deal with in. In my Emacs theme though, the `#` at the front causes the line to be rendered in a dark grey font so that it fades into the background and doesn't distract so much from the "real" content.

-   Next in lines 7-10, we define the learning intentions. We create a list in Org Mode, simply use a bullet character such as `-`, `+` or `*` (that last one needs to be preceeded with white space so it is not interpreted as an Org Mode heading). On line 8 you see the `#+attr_latex:` directive which allows you to modify the \\(\LaTeX\\) environment that follows, this this case an `itemize` bullet list. In this example, I decrease the separation between the bullet list items to make the list more compact. This technique can be used to tweak the appearance of other environments throughout the document.

-   On line 12 I give a textbook reference that I normally highlight using italics, which in Org Mode is achieve by bracketing the text with `/` symbols (much nicer than writing `\emph{italic text}`, isn't it?).


### Warm up/Do Now {#warm-up-do-now}

Most teachers understand the benefit of giving students something to get started on as soon as they sit down, the so-called "Do Now" activity. It not only helps students transition into the lesson; it also allows for some "formative assessment" to determine how well the students understand the previously-covered material.

I like to put the "Do Now" activity on the front page in a box. So, let's write a heading and give the student some warm-up exercises to do.

```org
* Warm-Up
#+attr_latex: :options [colback=white]
#+begin_tcolorbox
1. The inverse operation to *differentiation* is \cloze{3cm}
   \tcbline

2. For each of the following equations, find $\diff{y}{x}$

   #+attr_latex: :options [itemsep=2.8cm,after=\vspace{2cm}]
   1. $y=x^2$
   1. $y=\sin x$
   \tcbline

3. Differentiate the following:

   #+attr_latex: :environment tablenuma :options [after-item-skip=2.8cm,after-skip=2cm](2)
   1. $y=\cos(x)$
   2. $f(x)=\tan x$
   3. $g=\frac{1}{x^2}$
   4. $y=e^{\sin x}$
   #+latex: ~
#+end_tcolorbox
```

-   Line 1 contains an Org Mode header that will create a new section in the document (since there is no `:ignore:` tag).
-   Next I create a `tcolorbox` around the warm-up exercises, not by typing \\(\LaTeX\\) code directly, but by bracketing the content with a `#+begin_tcolorbox ... #+end_tcolorbox` pair. This is a general technique you can use to insert a \\(\LaTeX\\) environment into your document, by typing `#+begin_<environment>/ ... #+end_<environment>`, where `<environment>` is the name of the \\(\LaTeX\\) environment you want to use.

    By default, a `tcolorbox` has a grey background. To supress that, you need to provide some options to the environment. That is of course done using the previously mentioned `#+attr_latex:` directive. You can see that line 2 sends the `tcolorbox` an option to make its background white.

-   Line 4, I ask the first question, using a stock-standard numbered list. I use the `\cloze{}` macro I defined earlier to give the students an underlined writing space to fill it -- just specify the length of the line in the curly braces.

-   Line 7 contains the next question, which consists of some sub-questions. If I want to write any inline maths notiation, I enclose it in `$ ... $` symbols just like in regular \\(\LaTeX\\). If you have currency in your text, this can cause problems, so an alternative is to use `\( ... \)`.

    To separate this question form the next, I put a `\tcbline` separator (which you can prefix with a `#+latex:` directive if you choose). It is important to indent it properly so Org Mode doesn't think this is the end of the numbered list.

-   Next I want to list out the subparts to the question. I start a new numbered list that is indented. Here I used `1.` to indicate a list item, but it doesn't really matter what number you write here. In the output, the indented items will be written with letters (a), (b), (c) etc.. You may notice I even doubled up on the number `1.` -- it doesn't matter, \\(\LaTeX\\) will take care for the correct numbering.

    Students will need space to write their answers, so at the start of the list I include a `#+attr_latex:` directive where I set the spacing between list items using `itemsep=2cm`.

-   For the final question, I show you a special list environment provided by the `exesheet` package: the `tablenuma` list. This allows you to set your problems using multiple columns, great for many short questions that don't need to take up a whole line.

    I again use an Org Mode numbered list, but I need to tell Org Mode to use the `tablenuma` environment by specifying `:environment tablenuma` parameter. Again, I want to give the students some writing space. However, this environment doesn't use `itemsep`; instead it uses `after-item-skip` to put space between items and `after-skip` to put space at the end of the list.

    One problem with `after-skip` is that if you don't continue with a normal paragraph, the space at the end gets "swallowed up" by \\(\LaTeX\\). A hack you can use is to put an invisible white space at the end using the `#+latex: ~` like I did in line 21.
