content/posts/20250105_orgmode-lesson-notes/index.md


### Lesson Body {#lesson-body}

Now we can get to the meat of the lesson.

```org
\newpage

* Differentiation Rules
To differentiate a combination of functions, we have a number of rules.

** Product Rule
To differentiate the product of functions $y=u(x) \times v(x)$, use the product rule:
\[y = u'v + uv'\]

\exe Differentiate $y=x \sin x$
\vspace{3cm}

* Gradients
To calculate a gradient:

\begin{tikzpicture}
  \begin{axis}[
    minor tick num=0,
    axis x line=middle, axis y line=middle,
    xlabel=$x$,ylabel=$y$,
    xmin=-2, xmax=5, ymin=-2, ymax=5,
    xtick=\empty,
    extra x ticks={1,3},
    extra x tick labels={$x_1$,$x_2$},
    ytick=\empty,
    extra y ticks={1.8,3.4},
    extra y tick labels={$y_1$,$y_2$},
    ]
    \addplot [mark=none,domain=-0.5:4] {1+0.8*x};
    \addplot [mark=*] plot [
    error bars/.cd,
    y dir=minus,y fixed relative=1,
    x dir=minus, x fixed relative=1,
    error bar style={dotted},
    ] coordinates {(1,1.8) (3,3.4)};
    \draw (axis cs:3,3.4) |- (axis cs:1,1.8) node at (axis cs:2,1.5) {$x_2-x_1$} node at (axis cs:3.8,2.6) {$y_2-y_1$};
  \end{axis}
\end{tikzpicture}

#+attr_latex: :options [fonttitle=\bfseries,title={Gradient Formula}]
#+begin_tcolorbox
To find the gradient:
  \begin{align*}
    \text{Gradient} &= \frac{\text{rise}}{\text{run}} \\
                    &= \frac{y_2-y_1}{x_2-x_1}
  \end{align*}
#+end_tcolorbox

\exe Find the gradient of the line segment joining the points $P(1,2)$ and $Q(3,4)$
\vspace{1cm}
```

Here you see the Org Mode headings being translated to the different sections and subsections, and we can "fold away" any detail we don't want to see.

-   We start on a fresh page using `\newpage`

-   We use Org Mode headings to add in new sections/subsections of the lesson, and we can use Org Mode's visibility cycling (`<TAB>` key) to hide sections.

-   I have used the `exesheet` command "`\exe`" to introduce an example that I want to work through with the students. By default the numbering of the `\exe` examples/exercises is global across the whole document.

-   I've included a TikZ diagram, just to show how you can freely insert \\(\LaTeX\\) code as needed.


### Set Some Classwork/Homework {#set-some-classwork-homework}

Finally, you might want to set the students some exercises from the textbook.

```org
* Classwork/Homework
#+begin_tcolorbox
Year 12 Awesome Maths Textbook
- Ex. 13A Q2-11, 14, 15.
#+end_tcolorbox
```


## Export to PDF {#export-to-pdf}

Now that we have written up our lesson notes, we can export to LaTeX/PDF. To make a PDF file, I might type something like `C-c C-e l p`, and I will get a PDF lookin something like this.

{{< embed-pdf url="20250105_example-lesson.pdf" >}}


## Final Thoughts {#final-thoughts}

The examples I gave were heavy in LaTeX code because I wanted to showcase the sorts of things that could be done when exporting from Org Mode. Overall, the collapsible headings in Org Mode make it easy to find your way around a complicated document, and it is possible to add even more Org Mode headings with the `:ignore:` tag if you want to make certain parts of the document collapsible.

I didn't show any examples of tables. Org Mode has a powerful table editor which makes tables much easier to produce and manage, and if you want to customise the look of a table, you can use the `#+attr_latex:` directive to tell Org Mode to use the powerful `tblr` package that all \\(\LaTeX\\) users should learn about if they haven't already.

One thing I would like to explore further is the embedding of code to generate content -- for example, to produce tables of $z$-values programatically.
